import logo from './logo.svg';
import './App.css';
import { useRef, useState, useEffect } from 'react';

function App() {
  const audioRef = useRef(null);
  const h1Ref = useRef(null);
  const h1Reff = useRef(null);
  const [selectedFile, setSelectedFile] = useState(null);
  const [lineSyncMap, setLineSyncMap] = useState(null);
  const [wordSyncMap, setWordSyncMap] = useState(null);

  const [currentLineIndex, setCurrentLineIndex] = useState(-1);
  const [currentWordIndex, setCurrentWordIndex] = useState(-1);
  const [currentWordRelIndex, setCurrentWordRelIndex] = useState(-1);

  var timestamps_and_text = [
    ["00:08", "දෙව්ලෝකෙන් පැනලා ආවේ"],
    ["00:11", "යන්න නෙවෙයි ආයේ"],
    ["00:13", "පොළොවේ කොඩිය දාල"],
    ["00:14", "අඩිය ගහල ඉන්න ආවේ"],
    ["00:16", "පෙම් රෝගෙන් මිදුනා වගේ"],
    ["00:18", "ඔලුව බරයි මාගේ"],
    ["00:20", "වඩිය පදමට ගෙන"],
    ["00:22", "පඩිය නැතුව ගෙදර ආවේ"],
    ["00:24", "වෙරළු මල් වෙරළු මල් වෙරළු මල්"],
    ["00:28", "වෙරළු මල් වෙරළු මල් තැලුවම ලල්"],
    ["00:31", "වෙරළු මල් වෙරළු මල් වෙරළු මල්"],
    ["00:35", "වෙරළු මල් වෙරළු මල් තැලුවම ලල්"],
    ["00:56", "දම්වැල කැඩුවා මන් දැන් එල"],
    ["00:57", "පිතිකරුවෙක් වගේ මැදපෙළ"],
    ["01:00", "නොබියව වටේම කෙල කෙල"],
    ["01:02", "නගිනවා ජිවිතේ පඩිපෙළ"],
    ["01:04", "ඉස්සර කුචි දැන් නං Nonfeeling's"],
    ["01:06", "Gas එපා උයන්නේ දර වලින්"],
    ["01:08", "කුමාරයෙක් මම උපන්න මලින්"],
    ["01:10", "වැදපන් පෙම ඉල්ලන්න කලින්"],
    ["01:12", "වටෙයන බස් නවතන්න"],
    ["01:13", "අපෙ හිත් යකෝ ඩිපෝ ද"],
    ["01:15", "බොට පන දෙන්න මට බෑ කෙල්ලේ"],
    ["01:17", "ඕනනං කපන ගිහින් ත්‍රිපෝෂ"],
    ["01:19", "කට්ට කාල රජ වුනේ මන් ආ"],
    ["01:21", "දැන් ඔයා බිසෝද"],
    ["01:23", "ගලේ චිත්‍රෙ අදින්න මන්"],
    ["01:25", "තොට මොන මගුල් ෆොටෝද"],
    ["01:29", "වෙරළු මල් වෙරළු මල් වෙරළු මල්"],
    ["01:33", "වෙරළු මල් වෙරළු මල් තැලුවම ලල්"],
    ["01:36", "වෙරළු මල් වෙරළු මල් වෙරළු මල්"],
    ["01:40", "වෙරළු මල් වෙරළු මල් තැලුවම ලල්"],
    ["02:01", "ග්‍රහලෝකෙන් බිමට වැටුනේ"],
    ["02:03", "දවල් තරුත් පෙනුනේ"],
    ["02:05", "පාට මලුත් පිපිලා"],
    ["02:07", "රෑට රෑට හීන පෙනුනේ"],
    ["02:09", "උබ ගාවින් හිටපු කාලේ"],
    ["02:11", "දැන් මට මතක නැනේ"],
    ["02:13", "විකට චරිත වාගේ"],
    ["02:15", "එකට ඉදල පලක් නැනේ"],
    ["02:16", "වෙරළු මල් වෙරළු මල් වෙරළු මල්"],
    ["02:20", "වෙරළු මල් වෙරළු මල් තැලුවම ලල්"],
    ["02:23", "වෙරළු මල් වෙරළු මල් වෙරළු මල්"],
    ["02:27", "වෙරළු මල් වෙරළු මල් තැලුවම ලල්"],
  ];

  var word_timestamps_and_text = [
    ["00:08.701", "දෙව්ලෝකෙන්"],
    ["00:09.101", "පැනලා"],
    ["00:09.461", "ආවේ"],
    ["00:11.001", "යන්න"],
    ["00:11.291", "නෙවෙයි"],
    ["00:11.661", "ආයේ"],
    ["00:13.101", "පොළොවේ"],
    ["00:13.501", "කොඩිය"],
    ["00:13.791", "දාල"],
    ["00:14.301", "අඩිය"],
    ["00:14.591", "ගහල"],
    ["00:14.921", "ඉන්න"],
    ["00:15.191", "ආවේ"],
    ["00:16.601", "පෙම්"],
    ["00:16.831", "රෝගෙන්"],
    ["00:17.251", "මිදුනා"],
    ["00:17.591", "වගේ"],
    ["00:19.001", "ඔලුව"],
    ["00:19.291", "බරයි"],
    ["00:19.601", "මාගේ"],
    ["00:21.081", "වඩිය"],
    ["00:21.391", "පදමට"],
    ["00:21.831", "ගෙන"],
    ["00:22.481", "පඩිය"],
    ["00:22.781", "නැතුව"],
    ["00:23.141", "ගෙදර"],
    ["00:23.481", "ආවේ"],
    ["00:24.421", "වෙරළු"],
    ["00:24.701", "මල්"],
    ["00:25.001", "වෙරළු"],
    ["00:25.291", "මල්"],
    ["00:25.601", "වෙරළු"],
    ["00:25.891", "මල්"],
    ["00:28.201", "වෙරළු"],
    ["00:28.491", "මල්"],
    ["00:28.791", "වෙරළු"],
    ["00:29.081", "මල්"],
    ["00:29.401", "තැලුවම"],
    ["00:29.791", "ලල්"],
    ["00:31.101", "වෙරළු"],
    ["00:31.391", "මල්"],
    ["00:31.691", "වෙරළු"],
    ["00:31.981", "මල්"],
    ["00:32.291", "වෙරළු"],
    ["00:32.581", "මල්"],
    ["00:35.691", "වෙරළු"],
    ["00:35.981", "මල්"],
    ["00:36.281", "වෙරළු"],
    ["00:36.571", "මල්"],
    ["00:36.881", "තැලුවම"],
    ["00:37.271", "ලල්"],
    ["00:56.481", "දම්වැල"],
    ["00:56.841", "කැඩුවා"],
    ["00:57.171", "මන්"],
    ["00:57.381", "දැන්"],
    ["00:57.621", "එල"],
    ["00:58.001", "පිතිකරුවෙක්"],
    ["00:58.601", "වගේ"],
    ["00:58.891", "මැදපෙළ"],
    ["01:00.501", "නොබියව"],
    ["01:00.941", "වටේම"],
    ["01:01.321", "කෙල"],
    ["01:01.541", "කෙල"],
    ["01:02.101", "නගිනවා"],
    ["01:02.501", "ජිවිතේ"],
    ["01:02.921", "පඩිපෙළ"],
    ["01:04.401", "ඉස්සර"],
    ["01:04.761", "කුචි"],
    ["01:05.101", "දැන්"],
    ["01:05.291", "නං"],
    ["01:05.541", "Nonfeeling's"],
    ["01:06.481", "Gas"],
    ["01:06.741", "එපා"],
    ["01:06.981", "උයන්නේ"],
    ["01:07.401", "දර"],
    ["01:07.621", "වලින්"],
    ["01:08.401", "කුමාරයෙක්"],
    ["01:08.981", "මම"],
    ["01:09.171", "උපන්න"],
    ["01:09.541", "මලින්"],
    ["01:10.301", "වැදපන්"],
    ["01:10.721", "පෙම"],
    ["01:10.981", "ඉල්ලන්න"],
    ["01:11.401", "කලින්"],
    ["01:12.401", "වටෙයන"],
    ["01:12.791", "බස්"],
    ["01:13.061", "නවතන්න"],
    ["01:13.701", "අපෙ"],
    ["01:13.931", "හිත්"],
    ["01:14.201", "යකෝ"],
    ["01:14.491", "ඩිපෝ"],
    ["01:14.791", "ද"],
    ["01:15.601", "බොට"],
    ["01:15.861", "පන"],
    ["01:16.091", "දෙන්න"],
    ["01:16.401", "මට"],
    ["01:16.591", "බෑ"],
    ["01:16.801", "කෙල්ලේ"],
    ["01:17.201", "ඕනනං"],
    ["01:17.591", "කපන"],
    ["01:17.921", "ගිහින්"],
    ["01:18.291", "ත්‍රිපෝෂ"],
    ["01:19.701", "කට්ට"],
    ["01:19.991", "කාල"],
    ["01:20.291", "රජ"],
    ["01:20.541", "වුනේ"],
    ["01:20.801", "මන්"],
    ["01:21.201", "ආ"],
    ["01:21.601", "දැන්"],
    ["01:21.891", "ඔයා"],
    ["01:22.151", "බිසෝද"],
    ["01:23.301", "ගලේ"],
    ["01:23.591", "චිත්‍රෙ"],
    ["01:23.951", "අදින්න"],
    ["01:24.341", "මන්"],
    ["01:25.201", "තොට"],
    ["01:25.491", "මොන"],
    ["01:25.751", "මගුල්"],
    ["01:26.131", "ෆොටෝද"],
    ["01:29.301", "වෙරළු"],
    ["01:29.591", "මල්"],
    ["01:29.891", "වෙරළු"],
    ["01:30.181", "මල්"],
    ["01:30.491", "වෙරළු"],
    ["01:30.781", "මල්"],
    ["01:33.001", "වෙරළු"],
    ["01:33.291", "මල්"],
    ["01:33.591", "වෙරළු"],
    ["01:33.881", "මල්"],
    ["01:34.191", "තැලුවම"],
    ["01:34.581", "ලල්"],
    ["01:37.001", "වෙරළු"],
    ["01:37.291", "මල්"],
    ["01:37.591", "වෙරළු"],
    ["01:37.881", "මල්"],
    ["01:38.191", "වෙරළු"],
    ["01:38.481", "මල්"],
    ["01:40.701", "වෙරළු"],
    ["01:40.991", "මල්"],
    ["01:41.291", "වෙරළු"],
    ["01:41.581", "මල්"],
    ["01:41.891", "තැලුවම"],
    ["01:42.281", "ලල්"],
    ["02:01.501", "ග්‍රහලෝකෙන්"],
    ["02:02.101", "බිමට"],
    ["02:02.361", "වැටුනේ"],
    ["02:03.401", "දවල්"],
    ["02:03.691", "තරුත්"],
    ["02:04.021", "පෙනුනේ"],
    ["02:05.301", "පාට"],
    ["02:05.591", "මලුත්"],
    ["02:05.921", "පිපිලා"],
    ["02:07.001", "රෑට"],
    ["02:07.231", "රෑට"],
    ["02:07.541", "හීන"],
    ["02:07.831", "පෙනුනේ"],
    ["02:09.201", "උබ"],
    ["02:09.361", "ගාවින්"],
    ["02:09.731", "හිටපු"],
    ["02:10.061", "කාලේ"],
    ["02:11.101", "දැන්"],
    ["02:11.331", "මට"],
    ["02:11.501", "මතක"],
    ["02:11.801", "නැනේ"],
    ["02:13.001", "විකට"],
    ["02:13.361", "චරිත"],
    ["02:13.731", "වාගේ"],
    ["02:14.801", "එකට"],
    ["02:15.091", "ඉදල"],
    ["02:15.391", "පලක්"],
    ["02:15.691", "නැනේ"],
    ["02:16.601", "වෙරළු"],
    ["02:16.891", "මල්"],
    ["02:17.191", "වෙරළු"],
    ["02:17.481", "මල්"],
    ["02:17.791", "වෙරළු"],
    ["02:18.081", "මල්"],
    ["02:20.401", "වෙරළු"],
    ["02:20.691", "මල්"],
    ["02:20.991", "වෙරළු"],
    ["02:21.281", "මල්"],
    ["02:21.591", "තැලුවම"],
    ["02:21.981", "ලල්"],
    ["02:24.301", "වෙරළු"],
    ["02:24.591", "මල්"],
    ["02:24.891", "වෙරළු"],
    ["02:25.181", "මල්"],
    ["02:25.491", "වෙරළු"],
    ["02:25.781", "මල්"],
    ["02:28.001", "වෙරළු"],
    ["02:28.291", "මල්"],
    ["02:28.591", "වෙරළු"],
    ["02:28.881", "මල්"],
    ["02:29.191", "තැලුවම"],
    ["02:29.581", "ලල්"]
  ];

  useEffect(() => {
    prepareLineSyncMap();
    prepareWordSyncMap();
  });

  const prepareLineSyncMap = () => {
    if (lineSyncMap !== null) return;
    
    var modified_map = timestamps_and_text.map((word) => {
      const [timestamp, text] = word;
      const [minutes, seconds] = timestamp.split(":");
      const millis = (parseInt(minutes) * 60 + parseInt(seconds)) * 1000;
      return [millis, text];
    });

    setLineSyncMap(modified_map);
  };

  const prepareWordSyncMap = () => {
    if (wordSyncMap !== null) return;
    
    var modified_map = word_timestamps_and_text.map((word) => {
      const [timestamp, text] = word;
      const [minutes, seconds] = timestamp.split(":");
      const millis = (parseInt(minutes) * 60 + parseFloat(seconds)) * 1000;
      return [millis, text];
    });

    setWordSyncMap(modified_map);
  };

  const updateCurrentLineIndex = (index) => {
    setCurrentLineIndex(index);
    h1Ref.current.innerText = lineSyncMap[index][1];
  };

  const updateCurrentWordIndex = (index) => {
    setCurrentWordIndex(index);
    h1Reff.current.innerText = wordSyncMap[index][1];
  };

  const updateIndexes = (lineIndex, wordIndex) => {
    var wordRelIndex = currentWordRelIndex;

    if (lineIndex !== currentLineIndex) {
      updateCurrentLineIndex(lineIndex);
      wordRelIndex = -1;
    }

    if (wordIndex !== currentWordIndex) {
      updateCurrentWordIndex(wordIndex);
      wordRelIndex++;
      console.log(wordRelIndex);
      
    } 

    setCurrentWordRelIndex(wordRelIndex);
  }

  const lineFilledWordIndexes = () => {

  }

  const handleFileChange = (event) => {
    const file = event.target.files[0];

    const fileURL = URL.createObjectURL(file);
    setSelectedFile(fileURL);

    // if (file && file.type === "audio/mp3") {
    //   const fileURL = URL.createObjectURL(file);
    //   setSelectedFile(fileURL);
    // } else {
    //   alert("Please select a valid MP3 file.");
    // }
  };

  const handleTimeUpdate = (event) => {
    const currentMillis = event.target.currentTime * 1000;

    var lineIndex = 0;
    var wordIndex = 0;

    const currentLine = lineSyncMap.find((line, index) => {
      lineIndex = index;
      return currentMillis >= line[0] && currentMillis < lineSyncMap[index + 1][0];
    });

    const currentWord = wordSyncMap.find((word, index) => {
      wordIndex = index;
      return currentMillis >= word[0] && currentMillis < wordSyncMap[index + 1][0];
    });

    updateIndexes(lineIndex, wordIndex);
  };

  return (
    <div>
      <input type="file" accept="audio/mp3" onChange={handleFileChange} />
      <audio ref={audioRef} src={selectedFile} onTimeUpdate={handleTimeUpdate} controls></audio>
      <h1 ref={h1Ref}>මතුවෙන්න</h1>

      <h1 ref={h1Reff}>මතුවෙන්න</h1>
    </div>
  );
}

export default App;
